#+TITLE: Doom Emacs Config
#+PROPERTY: header-args:emacs-lisp :noweb yes :results none :tangle config.el

** org-babel
Easier NixOS and org-babel integration:
#+begin_src emacs-lisp :noweb-ref nil
(defun zjn/with-pkgs (interpreter &rest pkgs)
  (s-concat
    "#!/usr/bin/env nix-shell\n"
     "#!nix-shell -p " (s-join " " pkgs) " -i " interpreter))
(defun zjn/with-pkgs-bash (&rest pkgs)
  (apply #'zjn/with-pkgs (cons "bash" pkgs)))
#+end_src

Use like so:

#+begin_example
#+begin_src bash :shebang (zjn/with-pkgs-bash "hello") :results verbatim
hello
#+end_src

#+RESULTS:
: Hello, world!
#+end_example
